spec/dummy/app/controllers/patients_controller.rb

  def index
    @patients = Patient.all
---
SELECT "patients".* FROM "patients"

    def set_patient
      @patient = Patient.find(params[:id])
---
SELECT  "patients".* FROM "patients" WHERE "patients"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]